Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document._Инвойс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>InformationRegister.ЦеныЗакупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварУжеОплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НеСоздаватьПриходную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументЗатрат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ИнвойсПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗамены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗатраты_</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументЗатрат</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходнаяНакладная/Ext/ObjectModule.bsl
Функция ПолучитьПартии(ТекДок)
	Если НЕ ЗначениеЗаполнено(ТекДок) Тогда Возврат Новый ТаблицаЗначений КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Партии.Ссылка
	                      |ИЗ
	                      |	Справочник.Партии КАК Партии
	                      |ГДЕ
	                      |	Партии.Док = &ДокПартии");
	Запрос.УстановитьПараметр("ДокПартии", ТекДок);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбновитьРеквизитПартии(Ста, Нов, Сч)

	Если Ста <> Нов Тогда   
		Ста = Нов;
		Сч = Сч + 1; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСтроку(Стр, ЗатратыОтправки)
	
	//Стр.Серия = Стр.Партия.Серия;
	//Стр.ЦенаЗакупки = Стр.Партия.ЦенаЗакупки;
	//Стр.СуммаЗакупки = Стр.ЦенаЗакупки * Стр.Количество;
	
	// © Primus1C  17.09.2024  НАЧАЛО ►  

	// добавим затраты "Отправок", затраты док-тов "Доп.затраты" уже добавлены

	Если ЗатратыОтправки = Неопределено ИЛИ ЗатратыОтправки.Количество() = 0 Тогда
		Стр.Серия 			= Стр.Партия.Серия;
		Стр.ЦенаЗакупки 	= Стр.Партия.ЦенаЗакупки;
		Стр.СуммаЗакупки 	= Стр.ЦенаЗакупки * Стр.Количество;
	Иначе
		//Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда 
			Затр = ЗатратыОтправки.Получить(Стр.Номенклатура);
			Если Затр <> Неопределено Тогда
				Стр.ВКД_ЦенаСЗатратами = Стр.ВКД_ЦенаСЗатратами + Затр; 	
				//Стр.ВКД_СуммаСЗатратами = Стр.ВКД_СуммаСЗатратами + Стр.ВКД_ЦенаСЗатратами * Стр.Количество; 	
				Стр.ВКД_СуммаСЗатратами = Стр.ВКД_ЦенаСЗатратами * Стр.Количество; 	
			КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Стр.Серия) Тогда
	//	Если ЗначениеЗаполнено(Стр.Партия) Тогда
	//		ОбПартия = стр.Партия.ПолучитьОбъект();     
	//	Иначе
	//		Партия = НайтиИлиСоздатьПартию(Стр.Номенклатура, Стр.Серия); 
	//		ОбПартия = Партия.ПолучитьОбъект();  
	//		ОбПартия.Наименование = "ПН_" + Лев(гоМгновение(Ссылка.Дата), 8);
	//		ОбПартия.Контрагент		= Ссылка.Контрагент;
	//		ОбПартия.Валюта			= Ссылка.Валюта;
	//		ОбПартия.ДатаПартии		= Ссылка.Дата;
	//	КонецЕсли;
	//Иначе  
	//	ОбПартия = стр.Партия.ПолучитьОбъект();
	//	Стр.Серия 			= Стр.Партия.Серия;
	//	Стр.ЦенаЗакупки 	= Стр.Партия.ЦенаЗакупки;
	//	Стр.СуммаЗакупки 	= Стр.ЦенаЗакупки * Стр.Количество;
	//КонецЕсли;
	//
	//// добавим затраты "Отправок", затраты док-тов "Доп.затраты" уже добавлены
	//
	////Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда 
	////	Затр = ЗатратыОтправки.Получить(Стр.Номенклатура);
	////	Если Затр <> Неопределено Тогда
	////		Стр.ВКД_ЦенаСЗатратами = Стр.ВКД_ЦенаСЗатратами + Затр; 	
	////		//Стр.ВКД_СуммаСЗатратами = Стр.ВКД_СуммаСЗатратами + Стр.ВКД_ЦенаСЗатратами * Стр.Количество; 	
	////		Стр.ВКД_СуммаСЗатратами = Стр.ВКД_ЦенаСЗатратами * Стр.Количество; 	
	////	КонецЕсли;
	////КонецЕсли;
	//
	//ОбПартия.ВКД_ЦенаСоСкидкой	= стр.ВКД_ЦенаСоСкидкой;
	////ОбПартия.ВКД_ЦенаСЗатратами	= стр.ВКД_ЦенаСЗатратами; 
	//
	//Попытка
	//	ОбПартия.Записать();	
	//Исключение
	//	Сообщить(НСтр("ru = 'Не удалось записать партию: '; en = 'Faled to save batch: '") + ОписаниеОшибки());
	//КонецПопытки;

	// © Primus1C  ОКОНЧАНИЕ ◄ 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
	// © Primus1C  17.09.2024  НАЧАЛО ►  
	
	// 0. Перезаполним цены из инвойса

	Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда
	
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Регистратор", ВКД_Инвойс);
		Запр.УстановитьПараметр("Поставка", Поставка);
		Запр.Текст = "ВЫБРАТЬ
		             |	ВКД_ОприходованиеНоменклатуры.Номенклатура КАК Номенклатура,
		             |	ВКД_ОприходованиеНоменклатуры.ЦенаЗакупки КАК ЦенаЗакупки,
		             |	ВКД_ОприходованиеНоменклатуры.ЦенаСоСкидкой КАК ЦенаСоСкидкой
		             |ИЗ
		             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ВКД_ОприходованиеНоменклатуры
		             |ГДЕ
		             |	ВКД_ОприходованиеНоменклатуры.Регистратор = &Регистратор
		             |	И ВКД_ОприходованиеНоменклатуры.Поставка = &Поставка";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайдСтроки = Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
			Для каждого СтрокаТЧ Из НайдСтроки Цикл
				Если СтрокаТЧ.ЦенаЗакупки <> Выборка.ЦенаЗакупки Тогда
					СтрокаТЧ.ЦенаЗакупки = Выборка.ЦенаЗакупки; 
					СтрокаТЧ.СуммаЗакупки = СтрокаТЧ.ЦенаЗакупки * СтрокаТЧ.Количество;
				КонецЕсли;
				Если СтрокаТЧ.ВКД_ЦенаСоСкидкой <> Выборка.ЦенаСоСкидкой Тогда
					СтрокаТЧ.ВКД_ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;	
					СтрокаТЧ.СуммаЗакупкиСоСкидкой = СтрокаТЧ.ВКД_ЦенаСоСкидкой * СтрокаТЧ.Количество;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;	
	
	// 1. Распределим в ТЧ затраты "док-тов доп.затрат"
	
	//ТаблицаТовары = Товары.Выгрузить();  
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приходная", Ссылка);	
	Запрос.УстановитьПараметр("ДопЗатраты", Затраты.Выгрузить(,"ДокументЗатрат").ВыгрузитьКолонку(0));	
	Запрос.Текст = "ВЫБРАТЬ 
	               |	ЕСТЬNULL(СУММА(ВКД_ДополнительныеЗатратыДокументы.СуммаНаценки), 0) КАК СуммаНаценки
	               |ИЗ
	               |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ВКД_ДополнительныеЗатратыДокументы
	               |ГДЕ
	               |	ВКД_ДополнительныеЗатратыДокументы.Ссылка В(&ДопЗатраты)
	               |	И ВКД_ДополнительныеЗатратыДокументы.Документ = &Приходная";
    Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий(); 
	ОбщаяСуммаКРаспределению = омСервер.ПересчетЗн(Выборка.СуммаНаценки, Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, Дата, 5);
	//Для каждого Стр из ТаблицаТовары Цикл	  
	Для каждого Стр из Товары Цикл	  
		Если ОбщаяСуммаКРаспределению = 0 Тогда 
			ДельтаЦены = 0;
		Иначе
			Если ВариантРаспределения = 1 Тогда
				лВесоваяЧасть = Стр.СуммаЗакупки / Сумма * 100  ;
				лСуммаКРаспределению = ОбщаяСуммаКРаспределению * лВесоваяЧасть / 100;
				ДельтаЦены = лСуммаКРаспределению / Стр.Количество;
			ИначеЕсли ВариантРаспределения = 2 Тогда
				ДельтаЦены = ОбщаяСуммаКРаспределению / ВКД_Количество;
			Иначе
				ДельтаЦены = 0;
			КонецЕсли;         
		КонецЕсли; 		
		Стр.ВКД_ЦенаСЗатратами = Стр.ЦенаЗакупки + ДельтаЦены;
		Стр.ВКД_СуммаСЗатратами = Стр.ВКД_ЦенаСЗатратами * Стр.Количество;
	КонецЦикла;
	
	// 2. Подготовим затраты док-тов "Отправка" для дальнейшего распределения
	
	ЗатратыОтправки = Документы.ПриходнаяНакладная.ЗатратыОтправки(ВКД_Инвойс, Поставка);
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	// 3. Создание/обновление партий
	
	ИзмененныеПартии = Новый Массив;
	НеактуальныеПартии = ПолучитьПартии(Ссылка);
	
	Для Каждого Стр Из Товары Цикл 
		
		ТекПар = Стр.Партия;
		Если НЕ ЗначениеЗаполнено(ТекПар) Тогда Продолжить КонецЕсли; 
		
		СтаПар = ТекПар.ПолучитьОбъект();
		ЕстИзм = 0;
		
		Если СтаПар.ПометкаУдаления Тогда СтаПар.УстановитьПометкуУдаления(Ложь); КонецЕсли;
		
		Имя = "ПН_" + Лев(гоМгновение(Дата), 8);
		
		ОбновитьРеквизитПартии(СтаПар.Наименование,	 	Имя, 					ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.Контрагент, 		Контрагент, 			ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.Док, 				Ссылка, 				ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.ДатаПартии, 		НачалоДня(Дата), 		ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.Валюта, 			Валюта, 				ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.Фирма, 			Фирма, 					ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.Консигнация, 		Консигнация, 			ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.ЦенаЗакупки,  	Стр.ЦенаЗакупки, 		ЕстИзм);
		ОбновитьРеквизитПартии(СтаПар.ВКД_ЦенаСоСкидкой,Стр.ВКД_ЦенаСоСкидкой, 	ЕстИзм);
		
		Если ЕстИзм > 0 Тогда 
			СтаПар.Записать();
			ИзмененныеПартии.Добавить(Стр.Партия); 
		КонецЕсли;
		
		Если НеактуальныеПартии.Количество() > 0 Тогда
			ПаблСтр = НеактуальныеПартии.Найти(ТекПар, "Ссылка");
			Если НЕ (ПаблСтр = Неопределено) Тогда НеактуальныеПартии.Удалить(ПаблСтр) КонецЕсли;
		КонецЕсли;  
		
		// © Primus1C  17.09.2024  НАЧАЛО ►
		//ПересчитатьСтроку(Стр);
		ПересчитатьСтроку(Стр, ЗатратыОтправки);
		// © Primus1C  ОКОНЧАНИЕ ◄    
		
	КонецЦикла; 
	
	Для Каждого ПаблСтр Из НеактуальныеПартии Цикл
		Тек = ПаблСтр.Ссылка.ПолучитьОбъект();
		Тек.УстановитьПометкуУдаления(Истина);
	КонецЦикла;  

	ДополнительныеСвойства.Вставить("ИзмененныеПартии", ИзмененныеПартии);  // для пересчета расх/возвр.накладных

	// 4. Итоги - реквизиты шапки 
	
	//ПересчитатьИтоги();
	Сумма = Товары.Итог("СуммаЗакупки");
	Строк = Товары.Количество();
	СуммаПривязано = Привязки.Итог("Сумма1");
	//ВКД++
	ВКД_СуммаСоСкидкой = Товары.Итог("ВКД_СуммаСоСкидкой");
	ВКД_СуммаСЗатратами = Товары.Итог("ВКД_СуммаСЗатратами");
	ВКД_Количество = Товары.Итог("Количество");
	//ВКД--
	ЕстьЗатраты = Товары.Итог("ЦенаЗакупки") <> Товары.Итог("ВКД_ЦенаСЗатратами");
	
	//2015.11.27
	//изначально суммы КР у нас нет
	СуммаКР = 0;
	
	//2016.01.30
	//есть флаг, когда долги не возникают, поэтому привязки не трогаем
	Если НЕ ТоварУжеОплачен Тогда  
		//а тут нужно подумать, есть 2 варианта, когда закрывается предоплата или когда приход выступает оплатой покупателя
		Для Каждого Стр Из Привязки Цикл
			//итак, мы закрываем для начала предоплату поставщика
			//когда то мы заплатили 100 долларов, сейчас приходуем в ГРН и указываем свой курс в окне привязок
			//все как в ДД для поставщиков
			//второй вариант - мы закрываем долг покупателя, тоже по своему курсу, например, там 100 доларов, а тут рубли - тоже потеря
			правильнаяСумма = омСервер.ПересчетЗн(Стр.Сумма2, Стр.Валюта2, Валюта, Фирма, Дата, 2);
			//ТУТ ПОМЕНЯЛИ МЕСТАМИ, а то неправильно получается при закрытии рублевой предоплаты по курсу 65
			Если правильнаяСумма <> Стр.Сумма1 Тогда гоПлюс(СуммаКР, Стр.Сумма1 - правильнаяСумма) КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = глПрефиксДефис(Фирма);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;
	
	
	// © Primus1C  01.07.2023  НАЧАЛО ►
	
	////Начало вставки Ви Код
	////Автор Веркеенко В.А. Задача 000008014 от 28.07.19
	//ВКД_ЗаполнитьНаОснованииИнвойса(ДанныеЗаполнения);
	////Конец вставки Ви Код 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._Инвойс") Тогда
    	лВариантЗаполнения = "Инвойс";
		лИнвойс = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Поставка") Тогда
			// инвойс+поставка
			Если ДанныеЗаполнения.Поставка = 0 Тогда
				лВариантЗаполнения = "Инвойс"; 
			Иначе
				лВариантЗаполнения = "Инвойс+Поставка";
			КонецЕсли;
			лИнвойс = ДанныеЗаполнения.Инвойс;
		Иначе
			// нов.документ без основания
			лВариантЗаполнения = "";
		КонецЕсли;
	КонецЕсли;	
		
	Если лВариантЗаполнения = "Инвойс" Тогда
		
		НеоприходованныеТоварыИнвойса = Документы.ПриходнаяНакладная.НеоприходованныеТоварыИнвойса(лИнвойс);
		Если НЕ НеоприходованныеТоварыИнвойса.ЕстьНеоприходованныеТовары Тогда
			ВКД_НеСоздаватьПриходную = Истина;
			ОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'По инвойсу приходные накладные уже созданы!'; en = 'Incoming waybills have already been created for this invoice!'"));
			Возврат;
		КонецЕсли;
		
		//		// Закомментирован старый (до поставок) функционал
		//
		//// Заполнение шапки 
		//Валюта 		= ДанныеЗаполнения.Валюта;
		//Контрагент 	= ДанныеЗаполнения.Контрагент;
		//Примечание 	= ДанныеЗаполнения.Примечание;
		//ВКД_Инвойс 	= ДанныеЗаполнения.Ссылка;
		//Сумма 		= ДанныеЗаполнения.Сумма;
		//ВКД_ДокументСкидки 			= ДанныеЗаполнения.ВКД_ДокументСкидки;
		//ВКД_СуммаСкидки 			= ДанныеЗаполнения.ВКД_Скидка;
		//ВКД_ИнвойсПоставщика 		= ДанныеЗаполнения.ВКД_НомерИнвойсаПоставщика;
		//ВКД_ДатаИнвойсаПоставщика 	= ДанныеЗаполнения.ВКД_ДатаИнвойсаПоставщика;
		//ВКД_НеСоздаватьПриходную 	= Ложь; // приходную надо создать, есть неоприходованная номенклатура
		//ВариантРаспределения 		= -1; 	// признак ввода на основании инвойса
		//
		//	// Заполнение ТЧ
		//	Для каждого Остаток Из НеоприходованныеТоварыИнвойса Цикл
		//		Если Остаток.Количество > 0 Тогда
		//			Для Инд = 1 По Остаток.Количество Цикл
		//				НоваяСтрока = Товары.Добавить();
		//				НоваяСтрока.Количество 			= 1;	 
		//				НоваяСтрока.Номенклатура 		= Остаток.Номенклатура;
		//				НоваяСтрока.СуммаЗакупки 		= Остаток.СуммаЗакупки ; // сумма равна цене закупки 
		//				НоваяСтрока.ЦенаЗакупки 		= Остаток.СуммаЗакупки/ Остаток.Количество;
		//				НоваяСтрока.ВКД_ЦенаСоСкидкой 	= Остаток.СуммаСоСкидкой/Остаток.Количество;
		//			КонецЦикла;
		//		Иначе	
		//			ОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, "Приходные накладные уже созданы по номенклатуре: " + Остаток.Номенклатура);
		//		КонецЕсли;
		//	КонецЦикла;

	ИначеЕсли лВариантЗаполнения = "Инвойс+Поставка" Тогда 
		
		НеоприходованныеТоварыИнвойса = Документы.ПриходнаяНакладная.НеоприходованныеТоварыИнвойса(лИнвойс, ДанныеЗаполнения.Поставка);
		Поставка = ДанныеЗаполнения.Поставка;
		Если НЕ НеоприходованныеТоварыИнвойса.ЕстьНеоприходованныеТовары Тогда
			ВКД_НеСоздаватьПриходную = Истина; 
			ОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, СтрШаблон(НСтр("ru = 'По поставке № %1 инвойса приходные накладные уже созданы!'; en = 'For delivery № %1 of the invoice, incoming waybills have already been created!'"), Поставка));  
			Возврат;
		КонецЕсли;
		
		//		// Закомментирован старый (до поставок) функционал
		//
		//// Заполнение шапки 
		//Валюта 		= ДанныеЗаполнения.Валюта;
		//Контрагент 	= ДанныеЗаполнения.Контрагент;
		//Примечание 	= ДанныеЗаполнения.Примечание;
		//ВКД_Инвойс 	= ДанныеЗаполнения.Ссылка;
		//Сумма 		= ДанныеЗаполнения.Сумма;
		//ВКД_ДокументСкидки 			= ДанныеЗаполнения.ВКД_ДокументСкидки;
		//ВКД_СуммаСкидки 			= ДанныеЗаполнения.ВКД_Скидка;
		//ВКД_ИнвойсПоставщика 		= ДанныеЗаполнения.ВКД_НомерИнвойсаПоставщика;
		//ВКД_ДатаИнвойсаПоставщика 	= ДанныеЗаполнения.ВКД_ДатаИнвойсаПоставщика;
		//ВКД_НеСоздаватьПриходную 	= Ложь; // приходную надо создать, есть неоприходованная номенклатура
		//ВариантРаспределения 		= -1; 	// признак ввода на основании инвойса
		//Поставка 					= ДанныеЗаполнения.Поставка;
		//
		//// Заполнение ТЧ
		//Для каждого Остаток Из НеоприходованныеТоварыИнвойса Цикл
		//	Если Остаток.Количество > 0 Тогда
		//		Для Инд = 1 По Остаток.Количество Цикл
		//			НоваяСтрока = Товары.Добавить();
		//			НоваяСтрока.Количество 			= 1;	 
		//			НоваяСтрока.Номенклатура 		= Остаток.Номенклатура;
		//			НоваяСтрока.СуммаЗакупки 		= Остаток.СуммаЗакупки ; // сумма равна цене закупки 
		//			НоваяСтрока.ЦенаЗакупки 		= Остаток.СуммаЗакупки/ Остаток.Количество;
		//			НоваяСтрока.ВКД_ЦенаСоСкидкой 	= Остаток.СуммаСоСкидкой/Остаток.Количество;
		//		КонецЦикла;
		//	Иначе	
		//		ОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, "Приходные накладные уже созданы по номенклатуре: " + Остаток.Номенклатура);
		//	КонецЕсли;
		//КонецЦикла;
		
	КонецЕсли;
	
	// Заполнение шапки 
	Если лВариантЗаполнения = "" Тогда  
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Валюта 		= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Валюта");
		Склад 		= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
	Иначе	
		Валюта 		= лИнвойс.Валюта;    
		Склад 		= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
		Контрагент 	= лИнвойс.Контрагент;
		//Примечание 	= лИнвойс.Примечание;
		ВКД_Инвойс 	= лИнвойс.Ссылка;
		Сумма 		= лИнвойс.Сумма;
		ВКД_ДокументСкидки 			= лИнвойс.ВКД_ДокументСкидки;
		ВКД_СуммаСкидки 			= лИнвойс.ВКД_Скидка;
		ВКД_ИнвойсПоставщика 		= лИнвойс.ВКД_НомерИнвойсаПоставщика;
		ВКД_ДатаИнвойсаПоставщика 	= лИнвойс.ВКД_ДатаИнвойсаПоставщика;
		//ВКД_НеСоздаватьПриходную 	= Ложь; // приходную надо создать, есть неоприходованная номенклатура
		ВариантРаспределения 	= -1; 	// признак ввода на основании инвойса
	КонецЕсли;

	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если Товары.Количество() = 0 Тогда
	//	Сообщить(НСтр("ru = 'Табличная часть пуста!'; en = 'There are no goods in the document!'"));
	//	Отказ = Истина;	
	//КонецЕсли;	
	
	Для Каждого Стр Из Товары Цикл 
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: не заполнен товар!'; en = 'Line %1: good not filled!'"), СокрЛП(Стр.НомерСтроки))); 
			Отказ = Истина;	
		КонецЕсли;
		Если Стр.Количество = 0 Тогда
			Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: не заполнено количество!'; en = 'Line %1: quantity not filled!'"), СокрЛП(Стр.НомерСтроки))); 
			Отказ = Истина;	
		КонецЕсли;
		//Если Стр.ЦенаЗакупки = 0 Тогда 
		//	Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: нулевая цена!'; en = 'Line %1: zero price!'"), СокрЛП(Стр.НомерСтроки))); 
		//	Отказ = Истина;	
		//КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ПараметрыСеанса.БезусловноеПроведениеДокументов Тогда
		// проверка серийных товаров, зарегистрированных инвойсами (неоприходованных)
		Запр = Новый Запрос; 
		Запр.УстановитьПараметр("Ссылка", 	Ссылка);
		Запр.УстановитьПараметр("Дата", 	?(ЗначениеЗаполнено(Ссылка), МоментВремени(), ТекущаяДата()));
		Запр.УстановитьПараметр("Фирма", 	Фирма);
		Запр.УстановитьПараметр("Склад", 	Склад);
		Запр.Текст = "ВЫБРАТЬ
		             |	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		             |	ПриходнаяНакладнаяТовары.Серия КАК Серия,
		             |	ОстаткиТовараОстатки.ОстатокОстаток КАК Остаток,
		             |	ПриходнаяНакладнаяТовары.НомерСтроки КАК НомерСтроки
		             |ИЗ
		             |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
		             |				&Дата,
		             |				Фирма = &Фирма
		             |					И Склад = &Склад) КАК ОстаткиТовараОстатки
		             |		ПО ПриходнаяНакладнаяТовары.Номенклатура = ОстаткиТовараОстатки.Номенклатура
		             |			И ПриходнаяНакладнаяТовары.Серия = ОстаткиТовараОстатки.Партия.Серия
		             |ГДЕ
		             |	ПриходнаяНакладнаяТовары.Ссылка = &Ссылка
		             |	И ПриходнаяНакладнаяТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		             |	И ПриходнаяНакладнаяТовары.Номенклатура.УчетПоСериям
		             |	И ОстаткиТовараОстатки.ОстатокОстаток > 0
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	НомерСтроки";  
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл   
			Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: серия %2 товара %3 найден остаток %4 шт.'; en = 'Line %1: series %2 of product %3 remaining %4 pcs found!'"), 
									Выборка.НомерСтроки, Выборка.Серия, Выборка.Номенклатура, Формат(Выборка.Остаток, "ЧДЦ=0")));
			Отказ = Истина;
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

Процедура ПроверкаВозможностиПроведения(ТаблицаТоваров, Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	              |	ПриходнаяНакладнаяТовары.Номенклатура,
	              |	СУММА(ПриходнаяНакладнаяТовары.Количество) КАК Количество
	              |ПОМЕСТИТЬ ВТ
	              |ИЗ
	              |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	              |ГДЕ
	              |	ПриходнаяНакладнаяТовары.Ссылка = &Ссылка
	              |	И НЕ ПриходнаяНакладнаяТовары.Ссылка.ПометкаУдаления
	              |	И ПриходнаяНакладнаяТовары.Ссылка.Проведен
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ПриходнаяНакладнаяТовары.Номенклатура
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ.Номенклатура,
	              |	ВТ.Количество,
	              |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	              |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаСоСкидкойОстаток, 0) КАК СуммаСоСкидкойОстаток,
	              |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаЗакупкиОстаток, 0) КАК СуммаЗакупкиОстаток
	              |ИЗ
	              |	ВТ КАК ВТ
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки(
	              |				&Период,
				  |				Документ = &Инвойс И	
	              |				Номенклатура В
	              |					(ВЫБРАТЬ
	              |						ВТ.Номенклатура
	              |					ИЗ
	              |						ВТ КАК ВТ)) КАК ВКД_ОприходованиеНоменклатурыОстатки
	              |		ПО ВТ.Номенклатура = ВКД_ОприходованиеНоменклатурыОстатки.Номенклатура" ;
	Запрос.УстановитьПараметр("Инвойс", ВКД_Инвойс);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//МоментИтогов = ?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Неопределено, МоментВремени());
	МоментИтогов = МоментВремени();
	Запрос.УстановитьПараметр("Период", МоментИтогов);
	РезультатЗапроса = Запрос.Выполнить();  
	ТаблицаТоваров = РезультатЗапроса.Выгрузить();

	Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество > Выборка.КоличествоОстаток Тогда  
				Отказ = Истина;      
				//+
				// проверим на пересорт с инвойсом
				ТекстПересорта = "";
				Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда          
					ТекстПересорта = ВозможенПересорт(Выборка.Номенклатура);
					Если ТекстПересорта <> "" Тогда
						ТекстПересорта = НСтр("ru = 'В инвойсе указана похожая номенклатура: '; en = 'The invoice indicates a similar good: '") + ТекстПересорта; 				
					КонецЕсли;
				КонецЕсли;
				//-
				Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = "Не хватает номенклатуры: " + Выборка.Номенклатура + " для оприходования в количестве " + СокрЛП(Выборка.Количество - Выборка.КоличествоОстаток) + " шт!";
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не хватает номенклатуры: %1 для оприходования в количестве %2 шт!'; en = 'There is not enough %2 items: %1 for capitalization!'"),Выборка.Номенклатура,СокрЛП(Выборка.Количество - Выборка.КоличествоОстаток));
				Если ТекстПересорта <> "" Тогда
					Сообщение.Текст  = Сообщение.Текст + Символы.ПС + ТекстПересорта;
				КонецЕсли;
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
		Если Отказ И ПараметрыСеанса.БезусловноеПроведениеДокументов Тогда
			Отказ = Ложь;      
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Документ проведен, несмотря на ошибки!'; en = 'The document was posted despite the error(s)!'");
			Сообщение.Сообщить();
		КонецЕсли;  
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// © Primus1C  03.02.2024  НАЧАЛО ►   
	
	//// По требованию Олега 30.11.2025
	//Если НЕ Окончательно И гоПользователь().УстанавливатьОкончательноВПриходныхНакладных Тогда
	//	Окончательно = Истина; 
	//	гоЗаписьЖурналаРегистрации("Установили", Ссылка.Метаданные().Синоним, "Установка {Окончательно}: автоматически при проведении", Ссылка, 2);
	//КонецЕсли;

	//// проверка движений партий с датами позже тек.док-та (08.06.2025)
	//
	//Запр = Новый Запрос; 
	//Запр.УстановитьПараметр("Ссылка", Ссылка);
	//Запр.УстановитьПараметр("Дата", Дата);
	//Запр.Текст = "ВЫБРАТЬ
	//             |	ОстаткиТовара.Партия.Серия КАК Партия,
	//             |	ОстаткиТовара.Регистратор КАК Регистратор
	//             |ИЗ
	//             |	РегистрНакопления.ОстаткиТовара КАК ОстаткиТовара
	//             |ГДЕ
	//             |	ОстаткиТовара.Период > &Дата
	//             |	И ОстаткиТовара.Партия В
	//             |			(ВЫБРАТЬ
	//             |				ПриходнаяНакладнаяТовары.Партия
	//             |			ИЗ
	//             |				Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	//             |			ГДЕ
	//             |				ПриходнаяНакладнаяТовары.Ссылка = &Ссылка)"; 
	//РезультатЗапроса = Запр.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	Выгрузка = Запр.Выполнить().Выгрузить();
	//	СписП = Новый СписокЗначений;
	//	СписП.ЗагрузитьЗначения(Выгрузка.ВыгрузитьКолонку("Партия"));  
	//	Выгрузка.Свернуть("Регистратор",); 
	//	СписД = Новый СписокЗначений;
	//	СписД.ЗагрузитьЗначения(Выгрузка.ВыгрузитьКолонку("Регистратор"));
	//    Сообщить(СтрШаблон("%1: %2
	//						|%3: %4",
	//						НСтр("ru = 'Найдены движения партий этой накладной с более поздней датой'; en = 'Movements of lots of this invoice with a later date were found'"),
	//						СписП,
	//						НСтр("ru = 'в документах'; en = 'in the documents'"),
	//						СписД));
	//    Отказ = Истина;
	//КонецЕсли;
	
	// РАСКОММЕНТИРОВАТЬ !!!! Временно 03.07.2025 - Марина
	// (раскомментировано 27.11.2025)
	// проверка оплат тек.док-та (08.06.2025)
	//Запр = Новый Запрос; 
	//Запр.УстановитьПараметр("Ссылка", Ссылка);
	//Запр.Текст = "ВЫБРАТЬ
	//             |	Долги.Регистратор КАК Регистратор
	//             |ИЗ
	//             |	РегистрНакопления.Долги КАК Долги
	//             |ГДЕ
	//             |	Долги.Док = &Ссылка";
	//РезультатЗапроса = Запр.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда 
	//	Выгрузка = Запр.Выполнить().Выгрузить();
	//	Спис = Новый СписокЗначений;
	//	Спис.ЗагрузитьЗначения(Выгрузка.ВыгрузитьКолонку("Регистратор"));  
	//    Сообщить(СтрШаблон("%1: %2", НСтр("ru = 'Найдена оплата этой накладной'; en = 'Payment for this invoice found'"), Спис));
	//    Отказ = Истина;
	//КонецЕсли;	
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ПроверкаВозможностиПроведения(ТаблицаТоваров, Отказ);
	
	Если Отказ Тогда
	    Возврат;
	КонецЕсли;
	
	ВалютаДоллар = ПараметрыСеанса.БазоваяВалюта;
	
	// Регистрируем к проведению расх.накладные с измененными ценами закупки
	
	Если ДополнительныеСвойства.ИзмененныеПартии.Количество() > 0 Тогда
	
		УстановитьПривилегированныйРежим(Истина);

		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	Продажи.Регистратор КАК Регистратор
		             |ИЗ
		             |	РегистрНакопления.Продажи КАК Продажи
		             |ГДЕ
		             |	Продажи.Партия В(&Партии)";
		Запр.УстановитьПараметр("Партии", ДополнительныеСвойства.ИзмененныеПартии);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбработкаДокументов.ЗарегистрироватьДокументКПроведению(Выборка.Регистратор, Ссылка);	
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
	
	КонецЕсли;	

	// Затраты
	
	НаборЗаписей = Движения.Затраты;
	ЗапросЗ = Новый Запрос;
	ЗапросЗ.УстановитьПараметр("Ссылка", Ссылка);
	
	ЗапросЗ.Текст = "ВЫБРАТЬ
	                |	ДопЗатратыДокументы.Ссылка КАК ДокументЗатрат,
	                |	ДопЗатратыДокументы.СуммаНаценки КАК СуммаЗатрат,
	                |	ДопЗатратыДокументы.Ссылка.Валюта КАК ВалютаЗатрат
	                |ИЗ
	                |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ДопЗатратыДокументы
	                |ГДЕ
	                |	ДопЗатратыДокументы.Ссылка В
	                |			(ВЫБРАТЬ
	                |				ПНЗатраты.ДокументЗатрат КАК ДокументЗатрат
	                |			ИЗ
	                |				Документ.ПриходнаяНакладная.Затраты КАК ПНЗатраты
	                |			ГДЕ
	                |				ПНЗатраты.Ссылка = &Ссылка)
	                |	И ДопЗатратыДокументы.Документ = &Ссылка";
	РезультатЗапроса = ЗапросЗ.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		
	Иначе
		
		ВыборкаЗ = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗ.Следующий() Цикл            
			ОбщаяСуммаКРаспределению = ВыборкаЗ.СуммаЗатрат;
			Для каждого Стр из Товары Цикл	  
				Если ВариантРаспределения = 1 Тогда
					лВесоваяЧасть = Стр.СуммаЗакупки / Сумма * 100;
					лСуммаКРаспределению = ОбщаяСуммаКРаспределению * лВесоваяЧасть / 100;
					Дельта = лСуммаКРаспределению / Стр.Количество;
				ИначеЕсли ВариантРаспределения = 2 Тогда
					Дельта = ОбщаяСуммаКРаспределению / ВКД_Количество;
				Иначе
					Дельта = 0;
					Продолжить;
				КонецЕсли;         
				НовЗапись = НаборЗаписей.Добавить(); 
				НовЗапись.Период 		= Дата;
				НовЗапись.Источник 		= ВыборкаЗ.ДокументЗатрат; 
				НовЗапись.Номенклатура 	= Стр.Номенклатура;
				НовЗапись.Партия 		= Стр.Партия;  
				НовЗапись.Количество	= Стр.Количество;
				НовЗапись.Сумма 		= Дельта;
				НовЗапись.Валюта 		= ВыборкаЗ.ВалютаЗатрат;  
				НовЗапись.Затрата		= Справочники.Номенклатура.ДополнительныеЗатраты; 
				НовЗапись.СуммаВБазВалюте = РаботаСВалютой.Пересчитать2025(Дельта, Валюта, ВалютаДоллар, Фирма, Дата); 
				НовЗапись.Зарегистрировано = ТекущаяДата();
			КонецЦикла;
		КонецЦикла;	
		НаборЗаписей.Записать(Истина); 
		
	КонецЕсли;

	// © Primus1C  ОКОНЧАНИЕ ◄
	
	ЕстьОстатки = Ложь;
	ЕстьДолги = Ложь;
	ЕстьНезакрытые = Ложь;
	//2015.11.27
	ЕстьРасходыДоходы = Ложь;
	//2015.12.11
	ЕстьПоставки = Ложь;
	
	Если Окончательно Тогда  
		
		Для Каждого Стр Из Товары Цикл
			Если Стр.Количество = 0 Тогда Продолжить КонецЕсли; 
			Если Стр.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда Продолжить КонецЕсли; 
			
			Движение = Движения.ОстаткиТовара.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Склад = Склад;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Партия = Стр.Партия;
			Движение.Остаток = Стр.Количество;
			Движение.Резерв = 0;
			ЕстьОстатки = Истина;
			
			////2015.12.11 
			// = Перенесено ниже =
			//Движение = Движения.Поставки.Добавить();
			//Движение.Период = Дата;
			//Движение.Фирма = Фирма;
			//Движение.Валюта = Валюта;
			//Движение.Поставщик = Контрагент;
			//Движение.Номенклатура = Стр.Номенклатура;
			//Движение.Количество = Стр.Количество;
			//Движение.Сумма = Стр.СуммаЗакупки;
			//ЕстьПоставки = Истина;  
			
		КонецЦикла;   
		
		// © Primus1C  08.03.2024  НАЧАЛО ► 
		//лКурсЗакупки = 0;
		//Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда
		//	лКурсЗакупки = ВКД_Инвойс.Курс;
		//КонецЕсли;
		//Если лКурс = 0 Тогда
		//	лКурс = гоКурс(Валюта, Фирма, Дата);
		//КонецЕсли;
		НаборЗаписей = РегистрыСведений.ЦеныЗакупки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		Запр = Новый Запрос;    
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		             |	СУММА(ПриходнаяНакладнаяТовары.Количество) КАК Количество,
		             |	СУММА(ПриходнаяНакладнаяТовары.СуммаЗакупки) КАК СуммаЗакупки
		             |ИЗ
		             |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
		             |ГДЕ
		             |	ПриходнаяНакладнаяТовары.Ссылка = &Ссылка
		             |	И ПриходнаяНакладнаяТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ПриходнаяНакладнаяТовары.Номенклатура"; 
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			// РС ЦеныЗакупки    
			Если Выборка.СуммаЗакупки > 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Номенклатура	= Выборка.Номенклатура;	
				НоваяЗапись.Поставщик		= Контрагент;
				НоваяЗапись.Валюта			= Валюта;
				НоваяЗапись.Цена			= омСервер.ПересчетЗн(Выборка.СуммаЗакупки/Выборка.Количество, Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, Дата, Фирма.ЧислоЗнаковЦенаЗакупки);  
				НоваяЗапись.Период			= Дата; 
			КонецЕсли;
			// РН Поставки  
			Движение = Движения.Поставки.Добавить();
			Движение.Период 			= Дата;
			Движение.Фирма 				= Фирма;
			Движение.Валюта 			= Валюта;
			Движение.Поставщик 			= Контрагент;
			Движение.Номенклатура 		= Выборка.Номенклатура;
			Движение.Количество 		= Выборка.Количество;
			Движение.Сумма 				= Выборка.СуммаЗакупки;
			ЕстьПоставки = Истина;  
		КонецЦикла;
		НаборЗаписей.Записать();
		// © Primus1C  ОКОНЧАНИЕ ◄

		//2016.01.30
		//есть флаг, когда долги не возникают
		Если НЕ ТоварУжеОплачен Тогда  
			Движение = Движения.Долги.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Док = Ссылка;
			Движение.Валюта = Валюта;
			Движение.Контрагент = Контрагент;
			Движение.ДолгПокупателя = 0;
			Движение.ПредоплатаПокупателя = 0;
			Движение.ДолгПоставщику = Сумма;
			Движение.ПредоплатаПоставщику = 0;
			Движение.Чем = 0;
			ЕстьДолги = Истина;
			
			Для Каждого Стр Из Привязки Цикл
				Движение = Движения.Долги.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Док = Стр.Док2;
				Движение.Валюта = Стр.Валюта2;
				Движение.Контрагент = Контрагент;
				Движение.ДолгПокупателя = ?(Стр.ЭтоПредоплата, 0, Стр.Сумма2);
				Движение.ПредоплатаПокупателя = 0;
				Движение.ДолгПоставщику = 0;
				Движение.ПредоплатаПоставщику = ?(Стр.ЭтоПредоплата, Стр.Сумма2, 0);
				Движение.Чем = Ссылка;
				ЕстьДолги = Истина;
				
				Движение = Движения.Долги.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Док = Ссылка;
				Движение.Валюта = Валюта;
				Движение.Контрагент = Контрагент;
				Движение.ДолгПокупателя = 0;
				Движение.ПредоплатаПокупателя = 0;
				Движение.ДолгПоставщику = Стр.Сумма1;
				Движение.ПредоплатаПоставщику = 0;
				Движение.Чем = Стр.Док2;
				ЕстьДолги = Истина;
			КонецЦикла; 
			
			//2015.11.27
			//универсально, независимо от типа, проводим КР, если они есть
			Если СуммаКР <> 0 Тогда
				Движение = Движения.РасходыДоходы.Добавить();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Статья = ?(СуммаКР < 0, Справочники.Статьи.РасходОтКР, Справочники.Статьи.ДоходОтКР);
				//здесь вид после статьи
				Движение.Вид = Движение.Статья.ВидСтатьи;
				Движение.Валюта = Валюта;
				Движение.Сумма = гоАбс(СуммаКР);  
				ЕстьРасходыДоходы = Истина;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Движение = Движения.НезакрытыеДокументы.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Контрагент = Контрагент;
		Движение.ВидДокумента = Перечисления.ВидДокумента.ПриходнаяНакладная;
		Движение.Количество = 1;
		ЕстьНезакрытые = Истина;
	КонецЕсли; 
	
	Движения.Долги.Записывать = ЕстьДолги;
	Движения.ОстаткиТовара.Записывать = ЕстьОстатки;
	Движения.НезакрытыеДокументы.Записывать = ЕстьНезакрытые;
	//2015.11.27
	Движения.РасходыДоходы.Записывать = ЕстьРасходыДоходы;
	//2015.12.11
	Движения.Поставки.Записывать = ЕстьПоставки;
	
	Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда 
		
		Движения.ВКД_ОприходованиеНоменклатуры.Записывать = Истина;
		Движения.ВКД_ОприходованиеНоменклатуры.Очистить();
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//              |	ПриходнаяНакладнаяТовары.Номенклатура,
		//              |	СУММА(ПриходнаяНакладнаяТовары.Количество) КАК Количество
		//              |ПОМЕСТИТЬ ВТ
		//              |ИЗ
		//              |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
		//              |ГДЕ
		//              |	ПриходнаяНакладнаяТовары.Ссылка = &Ссылка
		//              |	И НЕ ПриходнаяНакладнаяТовары.Ссылка.ПометкаУдаления
		//              |	И ПриходнаяНакладнаяТовары.Ссылка.Проведен
		//              |
		//              |СГРУППИРОВАТЬ ПО
		//              |	ПриходнаяНакладнаяТовары.Номенклатура
		//              |;
		//              |
		//              |////////////////////////////////////////////////////////////////////////////////
		//              |ВЫБРАТЬ
		//              |	ВТ.Номенклатура,
		//              |	ВТ.Количество,
		//              |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		//              |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаСоСкидкойОстаток, 0) КАК СуммаСоСкидкойОстаток,
		//              |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаЗакупкиОстаток, 0) КАК СуммаЗакупкиОстаток
		//              |ИЗ
		//              |	ВТ КАК ВТ
		//              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки(
		//              |				&Период,
		//			  |				Документ = &Инвойс И	
		//              |				Номенклатура В
		//              |					(ВЫБРАТЬ
		//              |						ВТ.Номенклатура
		//              |					ИЗ
		//              |						ВТ КАК ВТ)) КАК ВКД_ОприходованиеНоменклатурыОстатки
		//              |		ПО ВТ.Номенклатура = ВКД_ОприходованиеНоменклатурыОстатки.Номенклатура" ;
		//Запрос.УстановитьПараметр("Инвойс", ВКД_Инвойс);
		//Запрос.УстановитьПараметр("Ссылка", Ссылка);
		//МоментИтогов = ?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Неопределено, МоментВремени());
		//Запрос.УстановитьПараметр("Период", МоментИтогов);
		//РезультатЗапроса = Запрос.Выполнить();
		//Выборка = РезультатЗапроса.Выбрать();
		//
		//Пока Выборка.Следующий() Цикл   
		
		Для каждого стр Из ТаблицаТоваров Цикл
		
			//Если Выборка.Количество > Выборка.КоличествоОстаток И НЕ ПараметрыСеанса.БезусловноеПроведениеДокументов Тогда
			//	Отказ = Истина;      
			//	//+
			//	// проверим на пересорт с инвойсом
			//	ТекстПересорта = "";
			//	Если ЗначениеЗаполнено(ВКД_Инвойс) Тогда          
			//		ТекстПересорта = ВозможенПересорт(Выборка.Номенклатура);
			//		Если ТекстПересорта <> "" Тогда
			//			ТекстПересорта = НСтр("ru = 'В инвойсе указана похожая номенклатура: '; en = 'The invoice indicates a similar good: '") + ТекстПересорта; 				
			//		КонецЕсли;
			//	КонецЕсли;
			//	//-
			//	Сообщение = Новый СообщениеПользователю;
			//	//Сообщение.Текст = "Не хватает номенклатуры: " + Выборка.Номенклатура + " для оприходования в количестве " + СокрЛП(Выборка.Количество - Выборка.КоличествоОстаток) + " шт!";
			//	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не хватает номенклатуры: %1 для оприходования в количестве %2 шт!'; en = 'There is not enough %2 items: %1 for capitalization!'"),Выборка.Номенклатура,СокрЛП(Выборка.Количество - Выборка.КоличествоОстаток));
			//	Если ТекстПересорта <> "" Тогда
			//		Сообщение.Текст  = Сообщение.Текст + Символы.ПС + ТекстПересорта;
			//	КонецЕсли;
			//	Сообщение.Сообщить();
			//Иначе
				Движение = Движения.ВКД_ОприходованиеНоменклатуры.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				Движение.Период 		= Дата;
				Движение.Документ 		= ВКД_Инвойс;
				Движение.Номенклатура 	= стр.Номенклатура;
				Движение.СуммаЗакупки 	= ?(стр.Количество = стр.КоличествоОстаток, стр.СуммаЗакупкиОстаток, стр.Количество/стр.КоличествоОстаток*стр.СуммаЗакупкиОстаток);
				Движение.СуммаСоСкидкой = ?(стр.Количество = стр.КоличествоОстаток, стр.СуммаСоСкидкойОстаток, стр.Количество/стр.КоличествоОстаток*стр.СуммаСоСкидкойОстаток);
				Движение.Количество 	= стр.Количество;   
				Движение.ЦенаЗакупки	= ?(Движение.Количество = 0, Движение.СуммаЗакупки, Движение.СуммаЗакупки/Движение.Количество);
				Движение.Поставка		= Поставка;
			//КонецЕсли;
		КонецЦикла;
		
	    //ВКД_ЗаполнитьДанныеПартий(); 
		
		// © Primus1C  24.11.2023  НАЧАЛО ►
		
		// РС СостоянияИнвойсов 
		Если ВКД_Инвойс.Проведен Тогда
			РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(ВКД_Инвойс, СтатусПоПоступлениям(ВКД_Инвойс, Истина), , , , , , , Ссылка);
		КонецЕсли;
		
		// © Primus1C  ОКОНЧАНИЕ ◄
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	// © Primus1C  25.11.2023  НАЧАЛО ►
	//Если гоАдминистратор() Тогда 
	//	Возврат;
	//КонецЕсли; 
	Если ОбщегоНазначенияПовтИсп.ДоступБухгалтерии() И ЗначениеЗаполнено(ВКД_Инвойс) Тогда
		РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(ВКД_Инвойс, СтатусПоПоступлениям(ВКД_Инвойс, Ложь), , , , , , , Ссылка);
		Возврат;		
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄	
	
	Если Окончательно Тогда Сообщить(НСтр("ru = 'Отмена проведения невозможна! Документ закрыт {Окончательно}!'; en = 'Unposting is not possible! The document is closed {Finally}!'")); Отказ = Истина; КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда Сообщить(НСтр("ru = 'Отмена проведения невозможна! Документ не пустой!'; en = 'Unposting is not possible! The document is not empty'")); Отказ = Истина; КонецЕсли;
	
	//Если НЕ (гоМельник() ИЛИ гоКолинко() ИЛИ гоЕстьРоль("КомуВчераСклад")) Тогда
	//	Если НачалоДня(Дата) < гоТекущаяДата() Тогда
	//		Сообщить("Только Избранный!"); Отказ = Истина; Возврат; КонецЕсли; КонецЕсли; 
	
	// © Primus1C  25.11.2023  НАЧАЛО ►
	Если НЕ Отказ Тогда
		РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(ВКД_Инвойс, СтатусПоПоступлениям(ВКД_Инвойс, Ложь), , , , , , , Ссылка);
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры


#Область ВиКод__НЕАКТУАЛЬНЫЙ_ФУНКЦИОНАЛ_удалить

Процедура ВКД_ЗаполнитьНаОснованииИнвойса(ДанныеЗаполнения)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._Инвойс") Тогда
		
		ВКД_НеСоздаватьПриходную = Истина; // надо ли создавать приходную
		
		Для Каждого ТекСтрокаВКД_Товары Из ДанныеЗаполнения.ВКД_Товары Цикл
			
			Количество = ВКД_ОпределитьКоличествоНоменклатуры(ДанныеЗаполнения.Ссылка, ТекСтрокаВКД_Товары.Номенклатура); //по которым созданы приходные
			
			//++
			Количество = Количество + ОпределитьКоличествоКорректировок(ДанныеЗаполнения.Ссылка, ТекСтрокаВКД_Товары.Номенклатура);
			//--
					
			Если Количество = ТекСтрокаВКД_Товары.Количество Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "По номенклатуре: " + ТекСтрокаВКД_Товары.Номенклатура + " в количестве: " + Количество + " шт. приходные накладные созданы!";
				Сообщение.Сообщить();
				
			ИначеЕсли Количество < ТекСтрокаВКД_Товары.Количество Тогда //если не все оприходовано
				Разница = ТекСтрокаВКД_Товары.Количество - Количество;
				Сч = 0;
				Пока Сч < Разница Цикл  //построчно выводим перечень номенклатуры
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.Количество = 1;	 
					НоваяСтрока.Номенклатура = ТекСтрокаВКД_Товары.Номенклатура;
					НоваяСтрока.СуммаЗакупки = ТекСтрокаВКД_Товары.ЦенаЗакупки ; // сумма равна цене закупки 
					НоваяСтрока.ЦенаЗакупки = ТекСтрокаВКД_Товары.ЦенаЗакупки;
					НоваяСтрока.ВКД_ЦенаСоСкидкой = ТекСтрокаВКД_Товары.ЦенаСоСкидкой;
					НоваяСтрока.ВКД_СуммаСоСкидкой = ТекСтрокаВКД_Товары.ЦенаСоСкидкой;
					Сч = Сч + 1;
				КонецЦикла;
				
				// Заполнение шапки
				Валюта 		= ДанныеЗаполнения.Валюта;
				Контрагент 	= ДанныеЗаполнения.Контрагент;
				Примечание 	= ДанныеЗаполнения.Примечание;
				ВКД_Инвойс 	= ДанныеЗаполнения.Ссылка;
				ВКД_ДокументСкидки 	= ДанныеЗаполнения.ВКД_ДокументСкидки;
				ВКД_СуммаСкидки 	= ДанныеЗаполнения.ВКД_Скидка;
				ВКД_ИнвойсПоставщика 		= ДанныеЗаполнения.ВКД_НомерИнвойсаПоставщика;
				ВКД_ДатаИнвойсаПоставщика 	= ДанныеЗаполнения.ВКД_ДатаИнвойсаПоставщика;
				Сумма 						= ДанныеЗаполнения.Сумма;
				
				ВКД_НеСоздаватьПриходную = Ложь; // приходную надо создать, есть неоприходованная номенклатура
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ВКД_НеСоздаватьПриходную = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'По данному инвойсу приходные накладные уже созданы!'; en = 'Incoming waybills have already been created for this invoice!'");
		Сообщение.Сообщить();
	КонецЕсли;
	

КонецПроцедуры

Функция ВКД_ОпределитьКоличествоНоменклатуры(Ссылка,Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладнаяТовары.Номенклатура,
	               |	СУММА(ПриходнаяНакладнаяТовары.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	               |ГДЕ
	               |	ПриходнаяНакладнаяТовары.Ссылка.ВКД_Инвойс = &Ссылка
	               |	И ПриходнаяНакладнаяТовары.Номенклатура = &Номенклатура
	               |	И НЕ ПриходнаяНакладнаяТовары.Ссылка.ПометкаУдаления
	               |	И ПриходнаяНакладнаяТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходнаяНакладнаяТовары.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат	Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ВКД_ЗаполнитьДанныеПартий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладнаяТовары.Номенклатура,
	               |	ПриходнаяНакладнаяТовары.Серия,
	               |	ПриходнаяНакладнаяТовары.ВКД_ЦенаСоСкидкой КАК ВКД_ЦенаСоСкидкой,
	               |	ПриходнаяНакладнаяТовары.ВКД_ЦенаСЗатратами КАК ВКД_ЦенаСЗатратами,
	               |	ПриходнаяНакладнаяТовары.ЦенаЗакупки КАК ЦенаЗакупки,
	               |	Партии.Ссылка КАК Партия
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партии КАК Партии
	               |		ПО ПриходнаяНакладнаяТовары.Партия = Партии.Ссылка
	               |			И ПриходнаяНакладнаяТовары.Серия = Партии.Серия
	               |ГДЕ
	               |	ПриходнаяНакладнаяТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Партия = Выборка.Партия;
		Если ЗначениеЗаполнено(Партия) Тогда
			ОбъектПартия = Выборка.Партия.ПолучитьОбЪект();
			//ОбъектПартия.ВКД_ЦенаСЗатратами = Выборка.ВКД_ЦенаСЗатратами;
			ОбъектПартия.ВКД_ЦенаСоСкидкой  = Выборка.ВКД_ЦенаСоСкидкой;
			//ОбъектПартия.ВКД_ЦенаСЗатратами = Выборка.ВКД_ЦенаСЗатратами;	
			ОбъектПартия.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// © Primus1C  30.09.2023  НАЧАЛО ►

Функция ОпределитьКоличествоКорректировок(СсылкаИнвойс, Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаИнвойса.Номенклатура,
	               |	СУММА(КорректировкаИнвойса.Количество - КорректировкаИнвойса.КоличествоДоКорректировки) КАК Количество
	               |ИЗ
	               |	Документ.КорректировкаИнвойса.Товары КАК КорректировкаИнвойса
	               |ГДЕ
	               |	КорректировкаИнвойса.Ссылка.Инвойс = &Инвойс
	               |	И КорректировкаИнвойса.Номенклатура = &Номенклатура
	               |	И КорректировкаИнвойса.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КорректировкаИнвойса.Номенклатура";
	Запрос.УстановитьПараметр("Инвойс", СсылкаИнвойс);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат	Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄

#КонецОбласти


// © Primus1C  25.11.2023  НАЧАЛО ►

Функция НайтиИлиСоздатьПартию(Номенклатура, Серия)

	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Владелец", Номенклатура);
	Запр.УстановитьПараметр("Док", Ссылка);
	Запр.УстановитьПараметр("Серия", Серия);
	Запр.УстановитьПараметр("Фирма", Фирма);
	Запр.Текст = "ВЫБРАТЬ
	             |	Партии.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Владелец = &Владелец
	             |	И Партии.Док = &Док
	             |	И Партии.Серия = &Серия
	             |	И НЕ Партии.ПометкаУдаления
	             |	И Партии.Фирма = &Фирма
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	Партии.Ссылка
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Владелец = &Владелец
	             |	И Партии.Док = &Док
	             |	И Партии.Серия = &Серия
	             |	И Партии.ПометкаУдаления
	             |	И Партии.Фирма = &Фирма";
    Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
	 	П = Справочники.Партии.СоздатьЭлемент();
		П.Владелец 	= Номенклатура;
		П.Док 		= Ссылка;
		П.Серия 	= Серия;
		П.Фирма 	= Фирма; 
		П.Записать();
		Возврат П.Ссылка;
	КонецЕсли;
	
КонецФункции // НайтиИлиСоздатьПартию()

Функция СтатусПоПоступлениям(СсылкаИнвойс, СУчетомТекущейПриходнойНакладной)
	
	// 	Проверим полноту поступлений по инвойсу 
	Запр = Новый запрос; 
	Запр.УстановитьПараметр("Инвойс", 				СсылкаИнвойс);
	Запр.УстановитьПараметр("ПриходнаяНакладная", 	Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	Свод.Номенклатура КАК Номенклатура,
	             |	СУММА(Свод.КоличествоНеПоступило) КАК КоличествоНеПоступило,
	             |	СУММА(Свод.КоличествоПоИнвойсу) КАК КоличествоПоИнвойсу,
	             |	ВЫБОР
	             |		КОГДА СУММА(Свод.КоличествоПоИнвойсу) > 0
	             |			ТОГДА ВЫБОР
	             |					КОГДА СУММА(Свод.КоличествоНеПоступило) = 0
	             |						ТОГДА ""ПрибылПолностью""
	             |					КОГДА СУММА(Свод.КоличествоНеПоступило) = СУММА(Свод.КоличествоПоИнвойсу)
	             |						ТОГДА ""Отправлен""
	             |					ИНАЧЕ ""ПрибылЧастично""
	             |				КОНЕЦ
	             |		ИНАЧЕ ""НеОтправлен""
	             |	КОНЕЦ КАК Статус
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		Оприходование.Номенклатура КАК Номенклатура,
	             |		СУММА(Оприходование.КоличествоОборот) КАК КоличествоНеПоступило,
	             |		СУММА(Оприходование.КоличествоПриход) КАК КоличествоПоИнвойсу
	             |	ИЗ
	             |		РегистрНакопления.ВКД_ОприходованиеНоменклатуры.ОстаткиИОбороты(, , Регистратор, , Документ = &Инвойс) КАК Оприходование
	             |	ГДЕ
	             |		Оприходование.Регистратор <> &ПриходнаяНакладная
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		Оприходование.Номенклатура
	             |	
	             |	ОБЪЕДИНИТЬ
	             |	
	             |	ВЫБРАТЬ
	             |		ПриходнаяНакладнаяТовары.Номенклатура,
	             |		-СУММА(ПриходнаяНакладнаяТовары.Количество),
	             |		0
	             |	ИЗ
	             |		Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	             |	ГДЕ
	             |		ПриходнаяНакладнаяТовары.Ссылка = &ПриходнаяНакладная
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		ПриходнаяНакладнаяТовары.Номенклатура) КАК Свод
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Свод.Номенклатура";  
	Если НЕ СУчетомТекущейПриходнойНакладной Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, "СУММА(ПриходнаяНакладнаяТовары.Количество)", "0");	
	КонецЕсли;
	Выгрузка = Запр.Выполнить().Выгрузить(); 
	НайдСтроки = Выгрузка.НайтиСтроки(Новый Структура("Статус", "ПрибылПолностью"));
	лПрибылПолностью = НайдСтроки.Количество() > 0;
	НайдСтроки = Выгрузка.НайтиСтроки(Новый Структура("Статус", "ПрибылЧастично"));
	лПрибылЧастично = НайдСтроки.Количество() > 0;
	НайдСтроки = Выгрузка.НайтиСтроки(Новый Структура("Статус", "Отправлен"));
	лОтправлен = НайдСтроки.Количество() > 0;
	НайдСтроки = Выгрузка.НайтиСтроки(Новый Структура("Статус", "НеОтправлен"));
	лНеОтправлен = НайдСтроки.Количество() > 0;
	
	Если лПрибылЧастично Тогда
		Возврат Перечисления.СтатусыИнвойса.ЧастичноПрибыл; 
	ИначеЕсли лПрибылПолностью И лОтправлен Тогда // несколько поставок, есть прибывшие
		Возврат Перечисления.СтатусыИнвойса.ЧастичноПрибыл;
	ИначеЕсли лОтправлен Тогда
		Возврат Перечисления.СтатусыИнвойса.ВПути;
	ИначеЕсли лНеОтправлен и не	лПрибылПолностью и не лПрибылЧастично и не лОтправлен Тогда
		Возврат Неопределено; // не отправлен
	ИначеЕсли лПрибылПолностью И НЕ лНеОтправлен И НЕ лПрибылЧастично И НЕ лНеОтправлен Тогда 
		Возврат Перечисления.СтатусыИнвойса.Прибыл;
	Иначе	
		Возврат Перечисления.СтатусыИнвойса.ЧастичноПрибыл;
	КонецЕсли;
	
КонецФункции // ПоступленияПоИнвойсу()

Функция ВозможенПересорт(Номенклатура)
	
	Наименование = СокрЛП(Номенклатура.Наименование);   
	Если Сред(Наименование, СтрДлина(Наименование)-2, 1) = " " Тогда
		Спецификация = Прав(Наименование, 2);
		НаименованиеБезСпц = Лев(Наименование, СтрДлина(Наименование)-3);
	Иначе	
	     Возврат "";
	КонецЕсли;
	
	Результат = "";
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", ВКД_Инвойс);
	Запр.УстановитьПараметр("Наименование", Наименование);
	Запр.УстановитьПараметр("НаименованиеБезСпц", НаименованиеБезСпц+"%");
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	_ИнвойсВКД_Товары.Номенклатура.Наименование КАК Наименование
	             |ИЗ
	             |	Документ._Инвойс.ВКД_Товары КАК _ИнвойсВКД_Товары
	             |ГДЕ
	             |	_ИнвойсВКД_Товары.Номенклатура.Наименование ПОДОБНО &НаименованиеБезСпц
	             |	И _ИнвойсВКД_Товары.Номенклатура.Наименование <> &Наименование
	             |	И _ИнвойсВКД_Товары.Ссылка = &Ссылка"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Результат + Выборка.Наименование + ", ";
	КонецЦикла; 
	Если Результат <> "" Тогда
		Результат	= Лев(Результат, СтрДлина(Результат)-2);
	КонецЕсли;
	Возврат	Результат;
	
КонецФункции

// © Primus1C  ОКОНЧАНИЕ ◄
